Revit 2026 API

# FormulaManagerValidate Method

---

Validates the formuls

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string Validate(
	ElementId parameterId,
	Document document,
	string formula
)
```
```vb
Public Shared Function Validate (
	parameterId As ElementId,
	document As Document,
	formula As String
) As String
```
```cpp
public:
static String^ Validate(
	ElementId^ parameterId,
	Document^ document,
	String^ formula
)
```
```fsharp
static member Validate :
        parameterId : ElementId *
        document : Document *
        formula : string -> string
```

#### Parameters

parameterId ElementId

document Document

formula String

#### Return Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

It validates formula using list of global or family parameters depends on document type.

#### Reference

FormulaManager Class

Autodesk.Revit.DB Namespace